{
  "metadata": {
    "total_parameters": 60506624,
    "total_size": 121013248
  },
  "weight_map": {
    "decoder.block.0.layer.0.SelfAttention.k.weight": "model-00001-of-00002.safetensors",
    "decoder.block.0.layer.0.SelfAttention.o.weight": "model-00001-of-00002.safetensors",
    "decoder.block.0.layer.0.SelfAttention.q.weight": "model-00001-of-00002.safetensors",
    "decoder.block.0.layer.0.SelfAttention.relative_attention_bias.weight": "model-00001-of-00002.safetensors",
    "decoder.block.0.layer.0.SelfAttention.v.weight": "model-00001-of-00002.safetensors",
    "decoder.block.0.layer.0.layer_norm.weight": "model-00001-of-00002.safetensors",
    "decoder.block.0.layer.1.EncDecAttention.k.weight": "model-00001-of-00002.safetensors",
    "decoder.block.0.layer.1.EncDecAttention.o.weight": "model-00001-of-00002.safetensors",
    "decoder.block.0.layer.1.EncDecAttention.q.weight": "model-00001-of-00002.safetensors",
    "decoder.block.0.layer.1.EncDecAttention.v.weight": "model-00001-of-00002.safetensors",
    "decoder.block.0.layer.1.layer_norm.weight": "model-00001-of-00002.safetensors",
    "decoder.block.0.layer.2.DenseReluDense.wi.weight": "model-00001-of-00002.safetensors",
    "decoder.block.0.layer.2.DenseReluDense.wo.weight": "model-00001-of-00002.safetensors",
    "decoder.block.0.layer.2.layer_norm.weight": "model-00001-of-00002.safetensors",
    "decoder.block.1.layer.0.SelfAttention.k.weight": "model-00002-of-00002.safetensors",
    "decoder.block.1.layer.0.SelfAttention.o.weight": "model-00002-of-00002.safetensors",
    "decoder.block.1.layer.0.SelfAttention.q.weight": "model-00001-of-00002.safetensors",
    "decoder.block.1.layer.0.SelfAttention.v.weight": "model-00002-of-00002.safetensors",
    "decoder.block.1.layer.0.layer_norm.weight": "model-00002-of-00002.safetensors",
    "decoder.block.1.layer.1.EncDecAttention.k.weight": "model-00002-of-00002.safetensors",
    "decoder.block.1.layer.1.EncDecAttention.o.weight": "model-00002-of-00002.safetensors",
    "decoder.block.1.layer.1.EncDecAttention.q.weight": "model-00002-of-00002.safetensors",
    "decoder.block.1.layer.1.EncDecAttention.v.weight": "model-00002-of-00002.safetensors",
    "decoder.block.1.layer.1.layer_norm.weight": "model-00002-of-00002.safetensors",
    "decoder.block.1.layer.2.DenseReluDense.wi.weight": "model-00002-of-00002.safetensors",
    "decoder.block.1.layer.2.DenseReluDense.wo.weight": "model-00002-of-00002.safetensors",
    "decoder.block.1.layer.2.layer_norm.weight": "model-00002-of-00002.safetensors",
    "decoder.block.2.layer.0.SelfAttention.k.weight": "model-00002-of-00002.safetensors",
    "decoder.block.2.layer.0.SelfAttention.o.weight": "model-00002-of-00002.safetensors",
    "decoder.block.2.layer.0.SelfAttention.q.weight": "model-00002-of-00002.safetensors",
    "decoder.block.2.layer.0.SelfAttention.v.weight": "model-00002-of-00002.safetensors",
    "decoder.block.2.layer.0.layer_norm.weight": "model-00002-of-00002.safetensors",
    "decoder.block.2.layer.1.EncDecAttention.k.weight": "model-00002-of-00002.safetensors",
    "decoder.block.2.layer.1.EncDecAttention.o.weight": "model-00002-of-00002.safetensors",
    "decoder.block.2.layer.1.EncDecAttention.q.weight": "model-00002-of-00002.safetensors",
    "decoder.block.2.layer.1.EncDecAttention.v.weight": "model-00002-of-00002.safetensors",
    "decoder.block.2.layer.1.layer_norm.weight": "model-00002-of-00002.safetensors",
    "decoder.block.2.layer.2.DenseReluDense.wi.weight": "model-00002-of-00002.safetensors",
    "decoder.block.2.layer.2.DenseReluDense.wo.weight": "model-00002-of-00002.safetensors",
    "decoder.block.2.layer.2.layer_norm.weight": "model-00002-of-00002.safetensors",
    "decoder.block.3.layer.0.SelfAttention.k.weight": "model-00002-of-00002.safetensors",
    "decoder.block.3.layer.0.SelfAttention.o.weight": "model-00002-of-00002.safetensors",
    "decoder.block.3.layer.0.SelfAttention.q.weight": "model-00002-of-00002.safetensors",
    "decoder.block.3.layer.0.SelfAttention.v.weight": "model-00002-of-00002.safetensors",
    "decoder.block.3.layer.0.layer_norm.weight": "model-00002-of-00002.safetensors",
    "decoder.block.3.layer.1.EncDecAttention.k.weight": "model-00002-of-00002.safetensors",
    "decoder.block.3.layer.1.EncDecAttention.o.weight": "model-00002-of-00002.safetensors",
    "decoder.block.3.layer.1.EncDecAttention.q.weight": "model-00002-of-00002.safetensors",
    "decoder.block.3.layer.1.EncDecAttention.v.weight": "model-00002-of-00002.safetensors",
    "decoder.block.3.layer.1.layer_norm.weight": "model-00002-of-00002.safetensors",
    "decoder.block.3.layer.2.DenseReluDense.wi.weight": "model-00002-of-00002.safetensors",
    "decoder.block.3.layer.2.DenseReluDense.wo.weight": "model-00002-of-00002.safetensors",
    "decoder.block.3.layer.2.layer_norm.weight": "model-00002-of-00002.safetensors",
    "decoder.block.4.layer.0.SelfAttention.k.weight": "model-00002-of-00002.safetensors",
    "decoder.block.4.layer.0.SelfAttention.o.weight": "model-00002-of-00002.safetensors",
    "decoder.block.4.layer.0.SelfAttention.q.weight": "model-00002-of-00002.safetensors",
    "decoder.block.4.layer.0.SelfAttention.v.weight": "model-00002-of-00002.safetensors",
    "decoder.block.4.layer.0.layer_norm.weight": "model-00002-of-00002.safetensors",
    "decoder.block.4.layer.1.EncDecAttention.k.weight": "model-00002-of-00002.safetensors",
    "decoder.block.4.layer.1.EncDecAttention.o.weight": "model-00002-of-00002.safetensors",
    "decoder.block.4.layer.1.EncDecAttention.q.weight": "model-00002-of-00002.safetensors",
    "decoder.block.4.layer.1.EncDecAttention.v.weight": "model-00002-of-00002.safetensors",
    "decoder.block.4.layer.1.layer_norm.weight": "model-00002-of-00002.safetensors",
    "decoder.block.4.layer.2.DenseReluDense.wi.weight": "model-00002-of-00002.safetensors",
    "decoder.block.4.layer.2.DenseReluDense.wo.weight": "model-00002-of-00002.safetensors",
    "decoder.block.4.layer.2.layer_norm.weight": "model-00002-of-00002.safetensors",
    "decoder.block.5.layer.0.SelfAttention.k.weight": "model-00002-of-00002.safetensors",
    "decoder.block.5.layer.0.SelfAttention.o.weight": "model-00002-of-00002.safetensors",
    "decoder.block.5.layer.0.SelfAttention.q.weight": "model-00002-of-00002.safetensors",
    "decoder.block.5.layer.0.SelfAttention.v.weight": "model-00002-of-00002.safetensors",
    "decoder.block.5.layer.0.layer_norm.weight": "model-00002-of-00002.safetensors",
    "decoder.block.5.layer.1.EncDecAttention.k.weight": "model-00002-of-00002.safetensors",
    "decoder.block.5.layer.1.EncDecAttention.o.weight": "model-00002-of-00002.safetensors",
    "decoder.block.5.layer.1.EncDecAttention.q.weight": "model-00002-of-00002.safetensors",
    "decoder.block.5.layer.1.EncDecAttention.v.weight": "model-00002-of-00002.safetensors",
    "decoder.block.5.layer.1.layer_norm.weight": "model-00002-of-00002.safetensors",
    "decoder.block.5.layer.2.DenseReluDense.wi.weight": "model-00002-of-00002.safetensors",
    "decoder.block.5.layer.2.DenseReluDense.wo.weight": "model-00002-of-00002.safetensors",
    "decoder.block.5.layer.2.layer_norm.weight": "model-00002-of-00002.safetensors",
    "decoder.final_layer_norm.weight": "model-00002-of-00002.safetensors",
    "encoder.block.0.layer.0.SelfAttention.k.weight": "model-00001-of-00002.safetensors",
    "encoder.block.0.layer.0.SelfAttention.o.weight": "model-00001-of-00002.safetensors",
    "encoder.block.0.layer.0.SelfAttention.q.weight": "model-00001-of-00002.safetensors",
    "encoder.block.0.layer.0.SelfAttention.relative_attention_bias.weight": "model-00001-of-00002.safetensors",
    "encoder.block.0.layer.0.SelfAttention.v.weight": "model-00001-of-00002.safetensors",
    "encoder.block.0.layer.0.layer_norm.weight": "model-00001-of-00002.safetensors",
    "encoder.block.0.layer.1.DenseReluDense.wi.weight": "model-00001-of-00002.safetensors",
    "encoder.block.0.layer.1.DenseReluDense.wo.weight": "model-00001-of-00002.safetensors",
    "encoder.block.0.layer.1.layer_norm.weight": "model-00001-of-00002.safetensors",
    "encoder.block.1.layer.0.SelfAttention.k.weight": "model-00001-of-00002.safetensors",
    "encoder.block.1.layer.0.SelfAttention.o.weight": "model-00001-of-00002.safetensors",
    "encoder.block.1.layer.0.SelfAttention.q.weight": "model-00001-of-00002.safetensors",
    "encoder.block.1.layer.0.SelfAttention.v.weight": "model-00001-of-00002.safetensors",
    "encoder.block.1.layer.0.layer_norm.weight": "model-00001-of-00002.safetensors",
    "encoder.block.1.layer.1.DenseReluDense.wi.weight": "model-00001-of-00002.safetensors",
    "encoder.block.1.layer.1.DenseReluDense.wo.weight": "model-00001-of-00002.safetensors",
    "encoder.block.1.layer.1.layer_norm.weight": "model-00001-of-00002.safetensors",
    "encoder.block.2.layer.0.SelfAttention.k.weight": "model-00001-of-00002.safetensors",
    "encoder.block.2.layer.0.SelfAttention.o.weight": "model-00001-of-00002.safetensors",
    "encoder.block.2.layer.0.SelfAttention.q.weight": "model-00001-of-00002.safetensors",
    "encoder.block.2.layer.0.SelfAttention.v.weight": "model-00001-of-00002.safetensors",
    "encoder.block.2.layer.0.layer_norm.weight": "model-00001-of-00002.safetensors",
    "encoder.block.2.layer.1.DenseReluDense.wi.weight": "model-00001-of-00002.safetensors",
    "encoder.block.2.layer.1.DenseReluDense.wo.weight": "model-00001-of-00002.safetensors",
    "encoder.block.2.layer.1.layer_norm.weight": "model-00001-of-00002.safetensors",
    "encoder.block.3.layer.0.SelfAttention.k.weight": "model-00001-of-00002.safetensors",
    "encoder.block.3.layer.0.SelfAttention.o.weight": "model-00001-of-00002.safetensors",
    "encoder.block.3.layer.0.SelfAttention.q.weight": "model-00001-of-00002.safetensors",
    "encoder.block.3.layer.0.SelfAttention.v.weight": "model-00001-of-00002.safetensors",
    "encoder.block.3.layer.0.layer_norm.weight": "model-00001-of-00002.safetensors",
    "encoder.block.3.layer.1.DenseReluDense.wi.weight": "model-00001-of-00002.safetensors",
    "encoder.block.3.layer.1.DenseReluDense.wo.weight": "model-00001-of-00002.safetensors",
    "encoder.block.3.layer.1.layer_norm.weight": "model-00001-of-00002.safetensors",
    "encoder.block.4.layer.0.SelfAttention.k.weight": "model-00001-of-00002.safetensors",
    "encoder.block.4.layer.0.SelfAttention.o.weight": "model-00001-of-00002.safetensors",
    "encoder.block.4.layer.0.SelfAttention.q.weight": "model-00001-of-00002.safetensors",
    "encoder.block.4.layer.0.SelfAttention.v.weight": "model-00001-of-00002.safetensors",
    "encoder.block.4.layer.0.layer_norm.weight": "model-00001-of-00002.safetensors",
    "encoder.block.4.layer.1.DenseReluDense.wi.weight": "model-00001-of-00002.safetensors",
    "encoder.block.4.layer.1.DenseReluDense.wo.weight": "model-00001-of-00002.safetensors",
    "encoder.block.4.layer.1.layer_norm.weight": "model-00001-of-00002.safetensors",
    "encoder.block.5.layer.0.SelfAttention.k.weight": "model-00001-of-00002.safetensors",
    "encoder.block.5.layer.0.SelfAttention.o.weight": "model-00001-of-00002.safetensors",
    "encoder.block.5.layer.0.SelfAttention.q.weight": "model-00001-of-00002.safetensors",
    "encoder.block.5.layer.0.SelfAttention.v.weight": "model-00001-of-00002.safetensors",
    "encoder.block.5.layer.0.layer_norm.weight": "model-00001-of-00002.safetensors",
    "encoder.block.5.layer.1.DenseReluDense.wi.weight": "model-00001-of-00002.safetensors",
    "encoder.block.5.layer.1.DenseReluDense.wo.weight": "model-00001-of-00002.safetensors",
    "encoder.block.5.layer.1.layer_norm.weight": "model-00001-of-00002.safetensors",
    "encoder.final_layer_norm.weight": "model-00001-of-00002.safetensors",
    "shared.weight": "model-00001-of-00002.safetensors"
  }
}
